app/Http/Controllers/Warehouse/DeliveryController.php

            });
        });

        $deliveryStatus = Delivery::select('delivery_status')->distinct()->pluck('delivery_status');
---
SELECT distinct `delivery_status` FROM `deliveries`

        $orders = $ordersQuery->sortable()->filter(request(['search']))->orderBy('id', 'desc')->paginate($row);
        $deliveries = $deliveries->sortable()->filter(request(['search']))->orderBy('id', 'desc')->paginate($row);

        $sales = Customer::select('employee_id')->distinct()->get();
---
SELECT distinct `employee_id` FROM `customers`