app/Http/Controllers/Warehouse/DeliveryController.php

    public function input()
    {
        $row = (int) request('row', 20);
        $salesorderFilter = request('order_id', null);
        $categoryFilter = request('category_id', null);
        $jenjang = request('jenjang', null);
        $kelas = request('kelas', null);
        $mapel = request('mapel', null);

        $ordersQuery = Order::query()->where('order_status', 'Disetujui');
        // $productsQuery = Product::query();
        $productsQuery = Product::query()->whereHas('orderDetails', function($query) use ($ordersQuery) {
            $query->whereIn('order_id', $ordersQuery->pluck('id'));
        });
        $categories = Product::select('category_id')->distinct()->get();
---
SELECT `id` FROM `orders` WHERE `order_status` = 'Disetujui'
SELECT distinct `category_id` FROM `products`

    public function inputdoConfirmation(Request $request)
    {
        $rules = [
            'order_id' => 'required',
            'delivery_date' => 'date_format:Y-m-d|max:10',
        ];

        $validatedData = $request->validate($rules);
            $salesorder = Order::findOrFail($validatedData['order_id']);
---
SELECT * FROM `orders` WHERE `orders`.`id` = '236' LIMIT 1

    private function storeDeliveryOrder(Request $request, $suffix)
    {
        // Validate input
        $rules = [
            'order_id' => 'required|numeric',
        ];
        $validatedData = $request->validate($rules);

        // Ambil invoice terakhir tanpa mempertimbangkan suffix (R, H, RS, HS)
        $lastOrder = Delivery::where('invoice_no', 'like', 'DO-%-%')->orderByDesc('id')->first();
---
SELECT * FROM `deliveries` WHERE `invoice_no` like 'DO-%-%' ORDER BY `id` DESC LIMIT 1

        $validatedData['created_at'] = Carbon::now();

        // Insert delivery data
        $delivery_id = Delivery::insertGetId($validatedData);
---
INSERT INTO `deliveries` (`order_id`, `delivery_date`, `delivery_status`, `total_products`, `sub_total`, `invoice_no`, `packed_at`, `created_at`) VALUES ('240', '22-03-2025', 'Siap dikirim', 25, '1500000', 'DO-0006-RS', '2025-03-22 01:52:15', '2025-03-22 01:52:15')

        // Insert delivery details
        $contents = Cart::content();
        foreach ($contents as $content) {
            DeliveryDetails::insert([
                'delivery_id' => $delivery_id,
                'product_id' => $content->id,
                'quantity' => $content->qty,
                'unitcost' => $content->price,
                'total' => $content->total,
                'created_at' => Carbon::now(),
            ]);

            OrderDetails::where('order_id', $request->order_id)
                ->where('product_id', $content->id)
                ->update([
                    'to_send' => DB::raw('GREATEST(to_send - '.$content->qty.', 0)'),
                    // 'ready_to_send' => DB::raw('GREATEST(to_send - '.$content->qty.' + ready_to_send, 0)'),
                    'ready_to_send' => DB::raw('GREATEST(ready_to_send + '.$content->qty.', 0)'),
                    // 'ready_to_send' => $content->qty
                ]);
        }

        // Update shipping_status di orders
        $salesorder = Order::findOrFail($request->order_id);
        $salesorder->update(['shipping_status' => $request->shipping_status]);

        // Reduce the stock (Mengurangi Stok)
        $products = DeliveryDetails::where('delivery_id', $delivery_id)->get();

        foreach ($products as $product) {
            Product::where('id', $product->product_id)->update([
                'product_store' => DB::raw('GREATEST(product_store - '.$product->quantity.', 0)'),
                'product_ordered' => DB::raw('GREATEST(product_ordered - '.$product->quantity.', 0)'),
                'stock_needed' => DB::raw('GREATEST(product_ordered - product_store, 0)')
            ]);
---
INSERT INTO `delivery_details` (`delivery_id`, `product_id`, `quantity`, `unitcost`, `total`, `created_at`) VALUES (253, '3', '25', 60000, '1500000.00', '2025-03-22 01:52:15')
UPDATE `order_details` SET `to_send` = GREATEST(to_send - 25, 0), `ready_to_send` = GREATEST(ready_to_send + 25, 0), `order_details`.`updated_at` = '2025-03-22 01:52:15' WHERE `order_id` = '240' and `product_id` = '3'
SELECT * FROM `orders` WHERE `orders`.`id` = '240' LIMIT 1
UPDATE `orders` SET `shipping_status` = 'Pengiriman ke-1', `orders`.`updated_at` = '2025-03-22 01:52:15' WHERE `id` = 240
SELECT * FROM `delivery_details` WHERE `delivery_id` = 253
SELECT * FROM `products` WHERE `products`.`id` in (3)
UPDATE `products` SET `product_store` = GREATEST(product_store - 25, 0), `product_ordered` = GREATEST(product_ordered - 25, 0), `stock_needed` = GREATEST(product_ordered - product_store, 0), `products`.`updated_at` = '2025-03-22 01:52:15' WHERE `id` = '3'

        public function deliveredStatus(Request $request)
        {
            $delivery_id = $request->id;

            Delivery::findOrFail($delivery_id)
                ->update([
                    'delivery_status' => 'Terkirim',
                    'delivered_at' => Carbon::now()
                ]);

            $order_id = Delivery::where('id', $delivery_id)->value('order_id');

            $productQuantities = DeliveryDetails::where('delivery_id', $delivery_id)->select('product_id', 'quantity')->get();

            foreach ($productQuantities as $product) {
                OrderDetails::where('order_id', $order_id)
                    ->where('product_id', $product->product_id)
                    ->update([
                        'sent' => DB::raw("GREATEST(sent - {$product->quantity}, 0)"),
                        'delivered' => DB::raw("delivered + {$product->quantity}")
                    ]);
            }

            return back()->with('success', 'Status pesanan diperbarui menjadi Terkirim!');
---
SELECT * FROM `products` WHERE `products`.`id` in (65, 66, 68, 104, 115, 116, 118, 152, 210, 212, 227)

    public function index()
    {
        $row = (int) request('row', 10000);

        $user = auth()->user();
        $deliveryInvoiceNo = request('delivery_invoice_no', null);  // Get delivery invoice number from request
        $orderInvoiceNo = request('order_invoice_no', null);  // Get order invoice number from request
        $salesFilter = request('employee_id', null);
        $statusFilter = request('delivery_status', null);

        // Query dasar
        // $ordersQuery = Order::whereIn('order_status', ['Disetujui', 'Selesai'])->with('deliveries');
        $ordersQuery = Order::with(['customer', 'deliveries'])
        ->when(auth()->user()->hasRole('Sales'), function ($query) {
            $query->whereHas('customer', function ($q) {
                $q->where('employee_id', auth()->user()->employee_id);
            });
        }, function ($query) {
            // Kalau bukan Sales, pakai filter employee_id dari form
            if (request()->filled('employee_id')) {
                $query->whereHas('customer', function ($q) {
                    $q->where('employee_id', request('employee_id'));
                });
            }
        })
        ->whereIn('order_status', ['Disetujui', 'Selesai']);
---
SELECT * FROM `deliveries` WHERE `id` = 131 LIMIT 1

            // $deliveries = $ordersQuery->whereHas('customer', function ($ordersQuery) use ($user) {
            //     $ordersQuery->where('employee_id', $user->employee_id);
            // });
            $deliveries = $query->whereHas('salesorder.customer', function ($query) use ($user) {
                $query->where('employee_id', $user->employee_id);
            });
---
SELECT * FROM `employees` WHERE `employees`.`id` in (2, 3, 4, 9, 14)
SELECT * FROM `orders` WHERE `orders`.`id` in (127, 128, 129, 130, 131, 134, 135, 137, 138, 139, 140, 141, 142, 143, 144, 146, 147, 148, 149, 150, 151, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 202, 204, 205, 206, 207, 208, 209, 210, 212, 213, 214, 215, 216, 219, 220, 224, 225, 226, 227, 229, 230, 234, 235, 236, 237)