app/Http/Controllers/Marketing/CustomerController.php

SELECT * FROM `employees` WHERE `employees`.`id` in (2, 3, 4, 5)
---
    public function index()
    {
        $row = (int) request('row', 10);

        if ($row < 1 || $row > 10000) {
            abort(400, 'The per-page parameter must be an integer between 1 and 10000.');
        }

        $user = auth()->user();
        $salesFilter = request('employee_id', null);
        $potensi = request('Potensi', null);
        $jenjang = request('jenjang', null);

        $customers = Customer::with(['employee']);

        if ($user->hasRole('Sales')) {
            $customers->where('employee_id', $user->employee_id);

SELECT distinct `employee_id` FROM `customers`
SELECT * FROM `employees` WHERE `employees`.`id` in (2)
SELECT * FROM `employees` WHERE `department_id` = '2'
---
            $customers->where('NamaLembaga', 'like', "%$jenjang%");
        };

        $sales = Customer::select('employee_id')->distinct()->get();

        $employees = [];
        if ($user->hasRole('Sales')) {
            $employees = Employee::where('id', $user->employee_id)->get();
        } elseif ($user->hasAnyRole(['Super Admin', 'Manajer Marketing', 'Admin'])) {
            $employees = Employee::where('department_id', '2')->get();

SELECT * FROM `employees` WHERE `department_id` = '2'
SELECT * FROM `orders` WHERE `customer_id` = 93
---
    public function show(Customer $customer)
    {
        $employees = Employee::where('department_id', '2')->get();
        // Data SO
        $orders = Order::with('customer')
            ->where('customer_id', $customer->id)->get();

SELECT `orders`.*, `customers`.`employee_id` as `laravel_through_key` FROM `orders` inner join `customers` on `customers`.`id` = `orders`.`customer_id` WHERE `customers`.`employee_id` in (2, 3, 4, 5, 6, 9, 14)
---
    public function sales(Employee $sales)
    {
        $sales = Employee::where('department_id', 2)
                ->with(['orders' => function ($query) {
                    // $query->select('id', 'customer_id', 'order_status'); // Sesuaikan field yang diperlukan

                }])
                ->get();