app/Http/Controllers/Marketing/SalesOrderController.php

SELECT distinct `category_id` FROM `products`
SELECT * FROM `employees` WHERE `employees`.`id` in (2, 3, 4)
---
    public function input()
    {
        $row = (int) request('row', 20);
        $user = auth()->user();
        $categoryFilter = request('category_id', null);
        $jenjang = request('jenjang', null);
        $kelas = request('kelas', null);
        $mapel = request('mapel', null);

        $productsQuery = Product::query();
        $customersQuery = Customer::with(['employee']);
        // $customersQuery = Customer::all();
        $categories = Product::select('category_id')->distinct()->get();


        if ($row < 1 || $row > 100) {
            abort(400, 'The per-page parameter must be an integer between 1 and 100.');
        }

        if ($user->hasRole('Sales')) {
            $customersQuery->where('employee_id', $user->employee_id);

SELECT * FROM `customers` WHERE `customers`.`id` = '16' LIMIT 1
---
    public function inputSoConfirmation(Request $request)
    {
        $rules = [
            'customer_id' => 'required',
            'discount_percent' => 'numeric|required',
            'order_date' => 'date_format:Y-m-d|max:10',
            'pay' => 'integer|nullable',
            'due' => 'integer|nullable',
        ];

        $validatedData = $request->validate($rules);
            $customer = Customer::findOrFail($validatedData['customer_id']);

SELECT * FROM `orders` WHERE `invoice_no` like 'SO-%-%' ORDER BY `id` DESC LIMIT 1
---
    private function storeOrder(Request $request, $suffix)
    {
        // Validasi input
        $rules = [
            'customer_id' => 'required|numeric',
            'discount_percent' => 'numeric|required',
            'discount_rp' => 'numeric|nullable',
            'grandtotal' => 'numeric|nullable',
            'pay' => 'numeric|nullable',
            'due' => 'numeric|nullable',
        ];

        $validatedData = $request->validate($rules);

        // Perhitungan diskon
        $discount_percent = $request->input('discount_percent');
        $sub_total = Cart::subtotal();
        $discount_rp = $sub_total * ($discount_percent / 100);
        $grandtotal = $sub_total - $discount_rp;

        // Ambil invoice terakhir tanpa mempertimbangkan suffix (RO, HO, RS, HS)
        $lastOrder = Order::where('invoice_no', 'like', 'SO-%-%')->orderByDesc('id')->first();

INSERT INTO `orders` (`customer_id`, `discount_percent`, `discount_rp`, `grandtotal`, `order_date`, `payment_method`, `order_status`, `total_products`, `sub_total`, `invoice_no`, `due`, `shipping_status`, `payment_status`, `created_at`) VALUES ('90', '30', 46800, 109200, '19-03-2025', 'Transfer Tempo', 'Menunggu persetujuan', 3, '156000', 'SO-0007-RS', '156000', 'Belum ada pengiriman', 'Belum dibayar', '2025-03-19 03:06:17')
---
        $validatedData['created_at'] = Carbon::now();

        // Simpan data pesanan
        $order_id = Order::insertGetId($validatedData);

INSERT INTO `order_details` (`order_id`, `product_id`, `quantity`, `unitcost`, `total`, `to_send`, `ready_to_send`, `sent`, `delivered`, `created_at`) VALUES (239, '1', 1, 48000, '48000.00', 1, 0, 0, 0, '2025-03-19 03:06:17')
---
        // Simpan detail pesanan
        $contents = Cart::content();
        foreach ($contents as $content) {
            OrderDetails::insert([
                'order_id' => $order_id,
                'product_id' => $content->id,
                'quantity' => $content->qty,
                'unitcost' => $content->price,
                'total' => $content->total,
                'to_send' => $content->qty,
                'ready_to_send' => 0,
                'sent' => 0,
                'delivered' => 0,
                'created_at' => Carbon::now(),
            ]);

SELECT * FROM `employees` WHERE `employees`.`id` in (2, 3, 4, 9, 14)
---
    public function index()
    {
        $row = (int) request('row', 10000);

        $user = auth()->user();
        $invoiceNo = request('invoice_no', null);  // Get 'invoice_no' parameter from request
        $salesFilter = request('employee_id', null); // Use employee_id for sales filter
        $statusFilter = request('order_status', null);

        $ordersQuery = Order::query();
        $collections = Collection::query();

        if ($user->hasAnyRole(['Super Admin', 'Manajer Marketing', 'Admin', 'Admin Gudang'])) {
            if ($statusFilter) {
                $ordersQuery->where('order_status', 'like', $statusFilter);
            }
        }
        elseif ($user->hasRole('Sales')) {
            if ($statusFilter) {
                $ordersQuery->where('order_status', 'like', $statusFilter);
            }
            $ordersQuery->whereHas('customer', function ($query) use ($user) {
                $query->where('employee_id', $user->employee_id);
            });

SELECT * FROM `orders` ORDER BY `id` DESC LIMIT 10000 offset 0
SELECT count(*) as aggregate FROM `orders`
SELECT distinct `order_status` FROM `orders`
SELECT distinct `employee_id` FROM `customers`
---
            });
        }

        $orders = $ordersQuery->sortable()->filter(request(['search']))->orderBy('id', 'desc')->paginate($row);

        $orderStatus = Order::select('order_status')->distinct()->pluck('order_status');

        // Retrieve distinct sales employees for dropdown
        $sales = Customer::select('employee_id')->distinct()->get();

SELECT * FROM `customers`
SELECT * FROM `orders` WHERE `id` = 234 LIMIT 1
SELECT * FROM `order_details` WHERE `order_id` = 234 ORDER BY `id` ASC
SELECT * FROM `products` WHERE `products`.`id` in (8, 9, 281, 282, 283)
SELECT * FROM `productunits` WHERE `productunits`.`id` in (1)
SELECT * FROM `deliveries` WHERE `order_id` = 234 ORDER BY `id` DESC
SELECT * FROM `delivery_details` WHERE `delivery_id` in (248) ORDER BY `id` ASC
SELECT * FROM `products` WHERE `products`.`id` in (52, 53, 55, 56, 59, 64, 65, 68, 101, 102, 103, 105, 106, 109, 114, 115, 118)
SELECT * FROM `collections` WHERE `order_id` = 234 ORDER BY `id` ASC
---
    public function orderDetails(Int $order_id)
    {
        // Data SO
        $customer = Customer::all();
        $order = Order::where('id', $order_id)->first();
        $orderDetails = OrderDetails::with('product.category.productunit')->where('order_id', $order_id)
                        ->orderBy('id', 'asc')->get();

        // Data DO
        $deliveries = Delivery::where('order_id',  $order_id)
                        ->orderBy('id', 'desc')->get();
        $deliveryDetails = DeliveryDetails::with('product.category.productunit')
                        ->whereIn('delivery_id', $deliveries->pluck('id'))
                        ->orderBy('id', 'asc')->get();

        // Data Coll
        $collections = Collection::where('order_id', $order_id)
                        ->orderBy('id', 'asc')->get();