app/Http/Controllers/Finance/CollectionController.php

SELECT * FROM `orders` WHERE `order_status` = 'Disetujui' and `payment_status` in ('Belum Lunas', 'Belum dibayar')
SELECT * FROM `employees`
SELECT * FROM `banks`
SELECT * FROM `rekenings`
---
    public function input()
    {
        $row = (int) request('row', 20);
        $salesorders = request('order_id', null);
        $subtotal = request('subtotal', null);

        $ordersQuery = Order::query()->where('order_status', 'Disetujui')
                        ->whereIn('payment_status', ['Belum Lunas', 'Belum dibayar']);

        if ($row < 1 || $row > 100) {
            abort(400, 'The per-page parameter must be an integer between 1 and 100.');
        }

        if ($subtotal)  {
            $ordersQuery->where('sub_total', $subtotal);
        }

        return view('finance.collection.input', [
            'salesorders' => $ordersQuery->get(),
            'employees' => Employee::get(),
            'banks' => Bank::get(),
            'rekenings' => Rekening::get(),
        ]);

SELECT * FROM `orders` WHERE `orders`.`id` = '12' LIMIT 1
---
    public function inputColConfirmation(Request $request)
    {
        $rules = [
            'order_id' => 'integer|required',
            'paid_by' => 'string|required',
            'payment_method' => 'string|required',
            'received_by' => 'integer|required_if:payment_method,Tunai',
            'bank' => 'integer|required_if:payment_method,Transfer',
            'no_rek' => 'string|nullable',
            'transfer_to' => 'integer|nullable',
            'pay' => 'numeric|required',
            'discount_percent' => 'numeric|nullable',
            'discount_rp' => 'numeric|nullable',
            'PPh22_percent' => 'numeric|nullable',
            'PPh22_rp' => 'numeric|nullable',
            'PPN_percent' => 'numeric|nullable',
            'PPN_rp' => 'numeric|nullable',
            'admin_fee' => 'integer|nullable',
            'other_fee' => 'integer|nullable',
            'grandtotal' => 'numeric|required',
            'due' => 'numeric|required',
            'payment_status' => 'string|required',
            'payment_date' => 'date_format:Y-m-d|max:10',
        ];

        $validatedData = $request->validate($rules);
        $salesorder = Order::findOrFail($validatedData['order_id']);