routes/web.php

//

Route::get('/orders/chart-status', function () {
    $orders = Order::selectRaw('
            order_status,
            COUNT(*) as total_orders,
            SUM(sub_total) as total_sub_total,
            SUM(discount_rp) as total_discount,
            SUM(grandtotal) as total_grandtotal
        ')
        ->groupBy('order_status')
        ->orderBy('order_status', 'asc')
        ->get();
---
SELECT 
            order_status, 
            COUNT(*) as total_orders, 
            SUM(sub_total) as total_sub_total, 
            SUM(discount_rp) as total_discount, 
            SUM(grandtotal) as total_grandtotal
         FROM `orders` GROUP BY `order_status` ORDER BY `order_status` ASC