app/Http/Controllers/HumanResource/AttendanceController.php

    public function allAttendance($year, Request $request)
    {
        // Ambil bulan dari request, atau gunakan bulan saat ini jika tidak ada
        $month = $request->get('month', date('n'));

        // Tentukan awal dan akhir bulan
        $startOfMonth = Carbon::createFromDate($year, $month, 1);
        $endOfMonth = Carbon::createFromDate($year, $month, cal_days_in_month(CAL_GREGORIAN, $month, $year));

        // Buat koleksi tanggal
        $dates = collect();
        $currentDate = $startOfMonth->copy();

        while ($currentDate->lte($endOfMonth)) {
            $dates->push($currentDate->copy());
            $currentDate->addDay();
        }

        // Ambil semua pegawai
        $employees = Employee::orderBy('name')->get();

        $attendances = Attendance::with('employee')
                ->whereBetween('created_at', [$startOfMonth->startOfDay(), $endOfMonth->endOfDay()])
                ->orderBy('created_at', 'asc')
                ->get()
                ->groupBy(function($item) {
                    return Carbon::parse($item->created_at)->format('d M Y'); // Group by date
                });
---
SELECT * FROM `employees` WHERE `employees`.`id` in (1, 2, 3, 4, 9, 11, 12, 13, 14, 15)

    public function index()
    {
        $attendance = Attendance::where('employee_id', auth()->user()->employee_id)->whereDate('created_at', today())->first();

        $showCheckoutModal = false;

        if ($attendance && $attendance->status == 'Hadir' && is_null($attendance->work_journal)) {
            $showCheckoutModal = true;
        }

        $authenticatedUser = auth()->user(); // Get the authenticated user

        // Get the current date
        $today = Carbon::today();

        // Get the start and end of the current month
        $startOfMonth = $today->copy()->startOfMonth();
        $endOfMonth = $today->copy()->endOfMonth();

        // Generate dates from the start to the end of the current month
        $dates = [];
        $currentDate = $startOfMonth->copy();
        while ($currentDate->lte($endOfMonth)) {
            $dates[] = $currentDate->copy();
            $currentDate->addDay();
        }

        // Retrieve attendance records for the authenticated user for the current month
        $myattendances = Attendance::where('employee_id', $authenticatedUser->employee_id)
            ->whereBetween('created_at', [$startOfMonth->startOfDay(), $endOfMonth->endOfDay()])
            ->orderBy('created_at', 'asc')->get();
---
SELECT * FROM `users` WHERE exists (SELECT * FROM `employees` WHERE `users`.`employee_id` = `employees`.`id`)
SELECT * FROM `attendances` WHERE `employee_id` = 1 and date(`created_at`) = '2025-03-19' LIMIT 1
SELECT * FROM `attendances` WHERE `employee_id` = 1 and `created_at` between '2025-03-01 00:00:00' and '2025-03-31 23:59:59' ORDER BY `created_at` ASC

    public function create()
    {
        $users = User::has('employee')->get();
---
SELECT * FROM `users` WHERE exists (SELECT * FROM `employees` WHERE `users`.`employee_id` = `employees`.`id`)