app/Http/Controllers/Cashflow/CashflowIncomeController.php

    public function create()
    {
        return view('cashflow.income.create', [
            'departments' => Department::all(),
            'cashflowtypes' => CashflowType::all(),
            // 'cashflowdetails' => CashflowDetail::all(),
            'cashflowdetails' => CashflowDetail::with('cashflowcategory.cashflowtype')->whereHas('cashflowcategory.cashflowtype', function ($query) {
                $query->where('name', 'Pemasukan');})->get(),
            // 'cashflowdetails' => CashflowDetail::with('cashflowcategory')->whereHas('cashflowcategory', function ($query) {
            // $query->where('cashflowtype_id', 2);})->get(),
        ]);
---
SELECT * FROM `cashflowdetails`
SELECT * FROM `cashflowtypes`
SELECT * FROM `departments`