app/Http/Controllers/Dashboard/DashboardController.php

SELECT * FROM `users` WHERE exists (SELECT * FROM `employees` WHERE `users`.`employee_id` = `employees`.`id`)
SELECT * FROM `employees` WHERE `employees`.`id` in (1, 2, 3, 4, 9, 11, 12, 13, 14, 15)
SELECT * FROM `attendances` WHERE `employee_id` = 1 and date(`created_at`) = '2025-03-21' LIMIT 1
---
    public function index()
    {
        $users = User::has('employee')->get();
        $currentUser = auth()->user();

        $ordersQuery = Order::query();
        if ($currentUser->hasRole('Sales')) {
            $ordersQuery->whereHas('customer', function ($query) use ($currentUser) {
                $query->where('employee_id', $currentUser->employee_id);
            });
        } elseif ($currentUser->hasAnyRole(['Super Admin', 'Manajer Marketing', 'Admin'])) {
                $ordersQuery;
        } else if ($currentUser->hasAnyRole(['Admin Gudang'])) {
            $ordersQuery;
        } else {
            abort(403, 'Unauthorized action.');
        }

        $orders = $ordersQuery->sortable()->filter(request(['search']))->orderBy('id', 'desc');

        $attendance = Attendance::where('employee_id', $currentUser->employee_id)
                                ->whereDate('created_at', today())->first();